# Definition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..Definition Property
ScheduleField Class See Also
---
The ScheduleDefinition that this field belongs to.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleDefinition Definition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Definition As ScheduleDefinition
	Get
```

Visual C++
---
```text
public:
property ScheduleDefinition^ Definition {
	ScheduleDefinition^ get ();
}
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace